// 现在我们开始
// C++程序的大体框架: 包含头文件, 主函数.

//? 头文件就是一些写好的代码文件 我们可以包含进来  用这些代码

//* 比如我要使用标准输入输出, 那么头文件就是iostream

//* 包含的"语句" 叫预处理指令 包含头文件需要预处理指令(C++20可以用import
//这个我们以后说)
//! 例如(例如的英文:example):
#include <iostream>  // include的中文意思是包含, io就是input/output的缩写, stream是流的意思
//上面的这个iostream是一个文件(file) 里面有别人写好(称为"实现")的输入输出 "功能"
// 可以来看一下这个文件是什么样的qwq  

//这些就是iostream的全部文件 你可能觉得少 事实上iostream也include了其他文件 (

// 然后是主函数, 主函数是程序开始的地方, 也就是说从这里开始执行
// 函数是什么呢? 不要和数学的函数联想
// 函数(function), 由这样的结构构成:
//! 返回类型 函数名([参数列表]) {
    //! 具体的语句(我们以后说)
//!}
//! 例如:
int main() {
    //...
    //* 对了, "//"是单行注释 他后面的所有这一行的内容都会被忽略, * ? !啥的符号不用管
    // main的中文意思是主要的 这也就是我们的主函数 (标准规定主函数名字必须是main)
    //! int表示什么呢? 还记得我们的函数结构吗?
    // 对了 这里的int就是"返回类型"!
    //? 什么是返回类型呢? 
    // 函数(可选的)有一个返回值
}
